import numpy as np

def cluster(j):
    count[j] += 1
    return count


x = np.array([[1.00, 1.00, 0.17, 0.78, 0.70, 0.77, 0.68],
              [1.00, 0.00, 0.17, 0.58, 0.35, 0.00, 0.00],
              [0.00, 0.00, 0.17, 0.58, 0.35, 0.70, 0.60],
              [1.00, 1.00, 1.00, 0.77, 0.84, 0.75, 1.00],
              [0.00, 1.00, 0.33, 0.77, 0.70, 0.71, 0.71],
              [0.00, 1.00, 0.17, 0.77, 0.90, 0.87, 0.63],
              [0.00, 1.00, 0.00, 0.78, 0.65, 0.74, 0.81],
              [1.00, 0.00, 0.00, 0.52, 0.58, 0.59, 0.63],
              [1.00, 0.00, 0.00, 0.57, 0.24, 0.68, 0.49],
              [1.00, 0.00, 0.17, 0.52, 0.35, 0.13, 0.00],
              [0.00, 1.00, 1.00, 0.90, 0.99, 1.00, 1.00],
              [0.00, 1.00, 0.17, 0.89, 0.88, 0.70, 0.63],
              [1.00, 0.00, 0.00, 0.61, 0.00, 0.05, 0.49],
              [0.00, 1.00, 0.83, 0.83, 0.72, 0.77, 0.81],
              [1.00, 0.00, 0.00, 0.00, 0.03, 0.03, 0.49],
              [0.00, 1.00, 0.17, 0.65, 0.66, 0.68, 0.49],
              [1.00, 1.00, 0.67, 1.00, 1.00, 0.89, 1.00],
              [0.00, 1.00, 1.00, 0.85, 0.94, 0.92, 0.81],
              [1.00, 1.00, 0.83, 0.52, 0.58, 0.74, 0.49],
              [1.00, 0.00, 0.00, 0.57, 0.35, 0.03, 0.63]], float)
w = np.array([[0.20, 0.20, 0.30, 0.40, 0.40, 0.20, 0.50],
              [0.20, 0.80, 0.70, 0.80, 0.70, 0.70, 0.80],
              [0.80, 0.20, 0.50, 0.50, 0.40, 0.40, 0.40],
              [0.80, 0.80, 0.60, 0.70, 0.70, 0.60, 0.70]], float)
v = 0.3
epoch_quantity = 6
print("Начальные синаптические коэффициенты:")
print(w)
count = [0 for _ in range(len(w))]
list = [[] for _ in range(len(w))]

for epoch in range(1, epoch_quantity + 1):
    print(f"    Эпоха {epoch}:")
    for i in range(len(x)):
        R = []
        for j in range(len(w)):
            temp = np.array([])
            temp = np.append(temp, (x[i] - w[j]) ** 2)
            R.append(np.sqrt(sum(temp)))
        j = R.index(min(R))
        if epoch == 1:
            count = cluster(j)
            list[j].append(i+1)
        w[j] += v * (x[i] - w[j])
    v -= 0.05
    print("Синаптические коэффициенты:")
    print(np.around(w, decimals=2))
for i in range(len(w)):
    print(f"Размер кластера {i+1} составляет {count[i]} и состоит из примеров: {list[i]}")
